9/data/attachments/3f8989f9904a9c90.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Dustin_although_Friend_28870_7</nif:username>
            <nif:friendToBeRequested>soap_friends_820e7bf3-842a-4ec0-b85a-397ac4407f7d</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>